"""
constants.py
# Глобальные константы игры: карта комнат, предметы, загадки.
"""

ROOMS = {
    'entrance': {
        'description': 
        """
        Вы в тёмном входе лабиринта.
         Стены покрыты мхом.
         На полу лежит старый факел.
         """,
        'exits': {'north': 'hall', 'east': 'trap_room'},
        'items': ['torch'],
        'puzzle': None
    },

    # Новые комнаты Финальная - Сокровищница:
    'treasure_room': {
    'description': 'Сокровищница! Золотой сундук сияет в лучах света.',
    'exits': {'south': 'hall'},
    'items': ['treasure_chest'],
    'puzzle': (
        '''На сундуке написано: "Ты сможешь открыть меня, если вспомнишь
        о самом дорогом, что имеешь в жизни, и вот тебе подсказка:
        В печали молчит, а в счастье поёт,
        Без неё — тело есть,  а человек не живёт.
        Она не стареет, не рвётся, не тлеет,
        А лишь растёт, если сердце умеет.''',
        'душа'
        )
    },

    'hall': {
        'description': 
        """
        Большой зал с эхом. По центру стоит пьедестал
        с запечатанным сундуком.
        """,
        'exits': {'south': 'entrance', 'west': 'library', 'north': 'treasure_room'},
        'items': [],
        'puzzle': (
            '''На пьедестале надпись: "Назови число, которое идёт после девяти".
            Введи ответ цифрой или словом.''',
            '10'
        )
    },

    'trap_room': {
        'description': 
        """
        Комната с хитрой плиточной поломкой.
        На стене видна надпись: "Осторожно — ловушка".
        """,
        'exits': {'west': 'entrance'},
        'items': ['rusty_key'],
        'puzzle': (
            '''Система плит активна. Чтобы пройти,
             назови слово "шаг" три раза подряд
             (введи "шаг шаг шаг").''',
            'шаг шаг шаг'
        )
    },

    'library': {
        'description': """
        Пыльная библиотека. На полках старые свитки.
        Где‑то здесь может быть ключ от сокровищницы.
        """,
        'exits': {'east': 'hall', 'north': 'armory', 'west': 'chapel'},
        'items': ['ancient_book'],
        'puzzle': (
            '''В одном свитке загадка: "Я не огонь, но согреваю души.
            Я не вода, но утоляю жажду знаний. Что я?"''', 
            'книга'
         )
    },

    'armory': {
        'description': """
        Старая оружейная комната. На стене висит меч,
        рядом — небольшой свиток.
        """,
        'exits': {'south': 'library'},
        'items': ['sword'],
        'puzzle': (
            '''В свитке написано: Этот меч достанется тому,
            кто первый разгадает мою загадку:
            "Я мягкий, как пух, но ломаю деревья.
            Я тихий, как шёпот, но рву паруса. Что я?"
            ''',
            'ветер'
        )
    },

    # Новая комната 1: Заброшенная часовня
    'chapel': {
        'description': """
        Заброшенная часовня с разбитыми витражами.
        В центре — каменный алтарь со следами воска.
        """,
        'exits': {'south': 'secret_tunnel', 'east': 'library'},
        'items': ['candle', 'silver_cross'],
        'puzzle': (
            '''На алтаре выгравировано: "Я ласкаю, но обжигаю.
            Я согреваю, но могу убить.\
            Я рождаюсь от искры, а умираю от воды. Кто я?"
            ''',
            'огонь'
        )
    },

    # Новая комната 2: Тайный туннель
    'secret_tunnel': {
        'description': """
        Узкий сыроватый туннель. С потолка свисают корни деревьев.
        Вдалеке мерцает тусклый свет.
        """,
        'exits': {'north': 'chapel', 'west': 'underground_spring'},
        'items': ['rotten_wood', 'glowing_mushroom'],
        'puzzle': (
            '''На стене царапина: "Я умираю, когда ты светишь,
            Но рождаюсь, когда ты гасишь свет. Что я?"
            ''',
            'темнота'
        )
    },

    # Дополнительно: Подземный источник (для связи с туннелем)
    'underground_spring': {
        'description':'''
        Пещера с кристально чистым Источником. Вода издаёт тихий звон.
        У берега важный артефакт, который поможет добраться до центра Источника.
        ''',
        'exits': {'east': 'secret_tunnel', 'north': 'secret_island'},
        'items': ['small_boat'],
        'puzzle': (
            '''Чтобы получить артефакт, разгадай загадку:
            "Скольжу по воде, как по шёлку легко,
            Храню я улов и мечты моряков. Что я?"
            ''',
            'лодка',
        )
    },

    # Дополнительно: Секретный остров
    'secret_island': {
        'description':
        """
        Остров в центре Источника. 1 из Артефактов острова
        поможет тебе победить в игре.
        У берега подземного озера покачивается маленькая лодка,
        Садись в лодку и будь внимателен.
        """,
        'exits': {'south': 'underground_spring'},
        'items': ['bronze_box'],
        'puzzle': (
            '''На дне лодки бутылка с запиской, это загадка, которую нужно разгадать:
            "Я бегу, но не устаю.
            Я меняю форму, но не суть.
            Я бываю мягка, как шёлк,
            Или тверда, как сталь. Кто я?"
            ''',
            'вода'
        )
    },

}

REWARDS = {
                'entrance': 'torch',
                'trap_room': 'rusty_key',
                'library': 'ancient_book',
                'armory': 'sword',
                'chapel': ['silver_cross', 'candle'],
                'secret_tunnel': ['rotten_wood', 'glowing_mushroom'],
                'underground_spring': 'small_boat',
                'secret_island': 'bronze_box' 
            }
            

# Основные константы игры
START_ROOM = 'entrance'
WIN_ROOM = 'treasure_room'


COMMANDS = [
    "go | идти <направление>   - идти (north, south, east, west)",
    "north |  север | n        - идти на север",
    "south |   юг   | s        - идти на юг",
    "east  | восток | e        - идти на восток",
    "west  |  запад | w        - идти на запад",    
    "back  | назад             - вернуться назад", 
    "take  | взять <item>      - взять предмет",
    "use   | применить <item>  - использовать предмет",
    "look  | осмотреть         - осмотреть комнату",
    "items | артефакты         - показать артефакты",
    "solve | решить            - решить загадку",
    "help  | помощь            - помощь",
    "exit  | выход             - выход из игры"
]

# Шаблонные сообщения
MESSAGES = {
    'win': 'Поздравляем! Вы нашли сокровища и победили лабиринт!',
    'lose': 'Вы проиграли. Попробуйте снова.',
    'invalid_command': 'Неизвестная команда. Введи "помощь", увидеть список команд.',
    'no_exit': 'В этом направлении выхода нет.',
    'item_not_found': 'Такого предмета здесь нет.',
    'puzzle_solved': 'Загадка решена! Теперь можно двигаться дальше.',
    'puzzle_failed': 'Неверный ответ. Попробуйте ещё раз.',
    'item_taken': 'Вы взяли: {}',
    'already_have': 'У вас уже есть этот предмет.',
    'nothing_to_take': 'Здесь нет предметов для взятия.'
}

TOTAL_PUZZLES = len([r for r in ROOMS if ROOMS[r].get('puzzle')])

SIN_MULTIPLIER = 12.369369
STRETCH_FACTOR = 696.3333

TRAP_ROOMS = ['trap_room', 'secret_tunnel', 'treasure_room']